export default function Message() {
  return (
    <div data-aos="fade-up">
      <h3 className="text-2xl font-bold text-primary mb-6">رسالتنا</h3>
      <div className="space-y-6 text-lg text-secondarytext leading-relaxed">
        <p>
          في ترافيك بلس، رسالتنا هي تمكين المتاجر الإلكترونية والمشاريع التجارية
          من تحقيق نمو حقيقي ومستدام عبر أدوات واستراتيجيات تسويق رقمي ذكية
          ومخصصة.
        </p>

        <p>
          نلتزم بتقديم خدمات تسويقية مبنية على التحليل العميق، الإبداع، وفهم
          الجمهور المستهدف، لضمان الوصول إلى النتائج، مش بس الظهور.
        </p>

        <p>
          نسعى لأن نكون شريك نجاح فعلي، نساهم في بناء حضور رقمي قوي لكل عميل
          نخدمه، ونساعده على الوصول إلى عملائه، تعزيز مبيعاته، وبناء علاقة ثقة
          بينه وبين جمهوره.
        </p>

        <p className="text-lg font-semibold text-secondary">
          نحن لا نروّج فقط… نحن نساهم في النمو!
        </p>
      </div>
    </div>
  );
}
